# PointCollection Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCollection Properties
PointCollection Class See Also
---
The PointCollection type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | The number of points in this collection. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace